In [19]:
# Import libraries
# Initial imports
import psycopg2
import sys
import pandas as pd
from pathlib import Path
import matplotlib.pyplot as plt
import numpy as np
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score
from sklearn.cluster import KMeans
import plotly.express as px
import hvplot.pandas
import re
from sqlalchemy import create_engine
import sqlalchemy

In [20]:
# Connection parameters
import ic_config
param_dic = {
    "host"      : ic_config.host,
    "database"  : ic_config.database,
    "user"      : ic_config.username,
    "password"  : ic_config.password
}

# Create connect function to connect to PostgresSQL server
def connect(param_dic):
    conn = None
    try:
        print("Connecting to the PostgreSQL database...")
        conn = psycopg2.connect(**param_dic)
    except (Exception, psycopg2.DatabaseError) as error:
        print(error)
        sys.exit(1)
    print ("Connection successful.")
    return conn

In [21]:
# Function to get the dataframe
def postgresql_to_dataframe(conn, select_query, column_names):
    cursor = conn.cursor()
    try:
        cursor.execute(select_query)
    except (Exception, psycopg2.DatabaseError) as error:
            print("Error: %s" % error)
            cursor.close()
    
    # Get list of tuples
    tuples = cursor.fetchall()
    cursor.close()
    
    # Create pandas dataframe
    df = pd.DataFrame(tuples, columns=column_names)
    return df

In [22]:
# Connect to the database
conn = connect(param_dic)

column_names = ["country", "happinessrank", "happinessscore", "gdp", "family", "lifeexpectancy", "freedom", "generosity", "trust", "lat", "lng", "alcohol_liperyear"]
df = postgresql_to_dataframe(conn, "select * from whr_2019", column_names)
df

Connecting to the PostgreSQL database...
Connection successful.

,country,happinessrank,happinessscore,gdp,family,lifeexpectancy,freedom,generosity,trust,lat,lng,alcohol_liperyear
0,Brazil,32,6.300,1.00400,1.43900,0.80200,0.39000,0.09900,0.08600,-14.235004,-51.925280,19.3
1,Uruguay,33,6.293,1.12400,1.46500,0.89100,0.52300,0.12700,0.15000,-32.522779,-55.765835,15.7
2,Singapore,34,6.262,1.57200,1.46300,1.14100,0.55600,0.27100,0.45300,1.352083,103.819836,2.9
3,El Salvador,35,6.253,0.79400,1.24200,0.78900,0.43000,0.09300,0.07400,13.794185,-88.896530,12.8
4,Italy,36,6.223,1.29400,1.48800,1.03900,0.23100,0.15800,0.03000,41.871940,12.567380,12.0
...,...,...,...,...,...,...,...,...,...,...,...,...
149,Congo [DRC],127,4.418,0.09400,1.12500,0.35700,0.26900,0.21200,0.05300,-4.038333,21.758664,7.1
150,Côte d'Ivoire,99,4.944,0.56900,0.80800,0.23200,0.35200,0.15400,0.09000,7.539989,-5.547080,21.7
151,Myanmar [Burma],131,4.360,0.71000,1.18100,0.55500,0.52500,0.56600,0.17200,21.913965,95.956223,17.6
152,Macedonia [FYROM],84,5.274,0.98300,1.29400,0.83800,0.34500,0.18500,0.03400,41.608635,21.745275,None
153,Trinidad and Tobago,39,6.192,1.23100,1.47700,0.71300,0.48900,0.18500,0.01600,10.691803,-61.222503,14.2

In [23]:
# Connect to the database
conn = connect(param_dic)

column_names = ["country_code", "country"]
df2 = postgresql_to_dataframe(conn, "select * from countries", column_names)
df2

Connecting to the PostgreSQL database...
Connection successful.

    country_code               country
0             AD               Andorra
1             AE  United Arab Emirates
2             AF           Afghanistan
3             AG   Antigua and Barbuda
4             AI              Anguilla
..           ...                   ...
239           YE                 Yemen
240           YT               Mayotte
241           ZA          South Africa
242           ZM                Zambia
243           ZW              Zimbabwe

[244 rows x 2 columns]

In [24]:
# Merge country codes and metrics
df_final = pd.merge(df,df2, on = "country")
df_final

,country,happinessrank,happinessscore,gdp,family,lifeexpectancy,freedom,generosity,trust,lat,lng,alcohol_liperyear,country_code
0,Brazil,32,6.300,1.00400,1.43900,0.80200,0.39000,0.09900,0.08600,-14.235004,-51.925280,19.3,BR
1,Uruguay,33,6.293,1.12400,1.46500,0.89100,0.52300,0.12700,0.15000,-32.522779,-55.765835,15.7,UY
2,Singapore,34,6.262,1.57200,1.46300,1.14100,0.55600,0.27100,0.45300,1.352083,103.819836,2.9,SG
3,El Salvador,35,6.253,0.79400,1.24200,0.78900,0.43000,0.09300,0.07400,13.794185,-88.896530,12.8,SV
4,Italy,36,6.223,1.29400,1.48800,1.03900,0.23100,0.15800,0.03000,41.871940,12.567380,12.0,IT
...,...,...,...,...,...,...,...,...,...,...,...,...,...
149,Congo [DRC],127,4.418,0.09400,1.12500,0.35700,0.26900,0.21200,0.05300,-4.038333,21.758664,7.1,CD
150,Côte d'Ivoire,99,4.944,0.56900,0.80800,0.23200,0.35200,0.15400,0.09000,7.539989,-5.547080,21.7,CI
151,Myanmar [Burma],131,4.360,0.71000,1.18100,0.55500,0.52500,0.56600,0.17200,21.913965,95.956223,17.6,MM
152,Macedonia [FYROM],84,5.274,0.98300,1.29400,0.83800,0.34500,0.18500,0.03400,41.608635,21.745275,None,MK
153,Trinidad and Tobago,39,6.192,1.23100,1.47700,0.71300,0.48900,0.18500,0.01600,10.691803,-61.222503,14.2,TT

In [25]:
##create happines rank table
happines_rank = df_final[["country_code","happinessrank","happinessscore"]]
happines_rank

    country_code  happinessrank happinessscore
0             BR             32          6.300
1             UY             33          6.293
2             SG             34          6.262
3             SV             35          6.253
4             IT             36          6.223
..           ...            ...            ...
149           CD            127          4.418
150           CI             99          4.944
151           MM            131          4.360
152           MK             84          5.274
153           TT             39          6.192

[154 rows x 3 columns]

In [26]:
## export happines rank t
from config import db_password
"postgres://[user]:[password]@[location]:[port]/[database]"
db_string = f"postgresql://postgres:{db_password}@whr.csnc4l4qvlqd.us-east-2.rds.amazonaws.com/postgres"
engine = create_engine(db_string)
happines_rank.to_sql(name='happines_rank', con=engine, if_exists = "replace")

InternalError: (psycopg2.errors.DependentObjectsStillExist) cannot drop table happines_rank because other objects depend on it
DETAIL:  view clusters depends on table happines_rank
view whr_2019 depends on table happines_rank
view act_vs_pred_happinessdata depends on view whr_2019
HINT:  Use DROP ... CASCADE to drop the dependent objects too.

[SQL:
DROP TABLE happines_rank]
(Background on this error at: http://sqlalche.me/e/13/2j85)

In [25]:
##create gdp table
gdp = df_final[["country_code","gdp"]]
gdp

    country_code      gdp
0             BR  1.00400
1             UY  1.12400
2             SG  1.57200
3             SV  0.79400
4             IT  1.29400
..           ...      ...
149           CD  0.09400
150           CI  0.56900
151           MM  0.71000
152           MK  0.98300
153           TT  1.23100

[154 rows x 2 columns]

In [28]:
##export gdp table to the database
gdp.to_sql(name='gdp', con=engine, if_exists = "replace")

In [29]:
#create family table
family = df_final[["country_code","family"]]
family

    country_code   family
0             BR  1.43900
1             UY  1.46500
2             SG  1.46300
3             SV  1.24200
4             IT  1.48800
..           ...      ...
149           CD  1.12500
150           CI  0.80800
151           MM  1.18100
152           MK  1.29400
153           TT  1.47700

[154 rows x 2 columns]

In [30]:
##export family table to the database
family.to_sql(name='family', con=engine, if_exists = "replace")

In [46]:
##create life_expectancy table
life_expectancy = df_final[["country_code","lifeexpectancy"]]
life_expectancy

    country_code lifeexpectancy
0             BR        0.80200
1             UY        0.89100
2             SG        1.14100
3             SV        0.78900
4             IT        1.03900
..           ...            ...
149           CD        0.35700
150           CI        0.23200
151           MM        0.55500
152           MK        0.83800
153           TT        0.71300

[154 rows x 2 columns]

In [48]:
## export life_expectancy table to the database
life_expectancy.to_sql(name='life_expectancy', con=engine, if_exists = "replace")

In [34]:
## create freedom table
freedom = df_final[["country_code","freedom"]]


freedom

    country_code  freedom
0             BR  0.39000
1             UY  0.52300
2             SG  0.55600
3             SV  0.43000
4             IT  0.23100
..           ...      ...
149           CD  0.26900
150           CI  0.35200
151           MM  0.52500
152           MK  0.34500
153           TT  0.48900

[154 rows x 2 columns]

In [2]:
## export freedom table to the database

freedom.to_sql(name='freedom', con=engine, if_exists = "replace")

In [4]:
## create generosity table

generosity = df_final[["country_code","generosity"]]

generosity

In [37]:
## export generosity table to the database

generosity.to_sql(name='generosity', con=engine, if_exists = "replace")

In [39]:
## create alcohol table

alcohol = df_final[["country_code","alcohol_liperyear"]]
alcohol

    country_code alcohol_liperyear
0             BR              19.3
1             UY              15.7
2             SG               2.9
3             SV              12.8
4             IT              12.0
..           ...               ...
149           CD               7.1
150           CI              21.7
151           MM              17.6
152           MK              None
153           TT              14.2

[154 rows x 2 columns]

In [40]:
## export alcohol table to the database

alcohol.to_sql(name='alcohol', con=engine, if_exists = "replace")

In [14]:
## create coordinates table

coordinates = df_final[["country_code","lat","lng"]]
coordinates

    country_code         lat         lng
0             BR  -14.235004  -51.925280
1             UY  -32.522779  -55.765835
2             SG    1.352083  103.819836
3             SV   13.794185  -88.896530
4             IT   41.871940   12.567380
..           ...         ...         ...
149           CD   -4.038333   21.758664
150           CI    7.539989   -5.547080
151           MM   21.913965   95.956223
152           MK   41.608635   21.745275
153           TT   10.691803  -61.222503

[154 rows x 3 columns]

In [ ]:
## export coordinates table to the database
coordinates.to_sql(name='coordinates', con=engine, if_exists = "replace")